In [82]:
import pandas as pd

In [83]:
data_path = "C:/Users/Acer/Downloads/organizations-10000.csv"
df = pd.read_csv(data_path)
df.head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,522816eF8fdBE6d,Mckinney PLC,http://soto.com/,Sri Lanka,Synergized global system engine,1988,Dairy,3930
1,2,70C7FBD7e6Aa3Ea,Cunningham LLC,http://harding-duffy.com/,Namibia,Team-oriented fault-tolerant adapter,2018,Library,7871
2,3,428B397eA2d7290,Ruiz-Walls,http://www.atkins.biz/,Iran,Re-contextualized bifurcated moderator,2003,Hospital / Health Care,3095
3,4,9D234Ae8Cc51C1c,"Parrish, Osborne and Clarke",http://salazar.info/,British Indian Ocean Territory (Chagos Archipe...,Fully-configurable next generation concept,1989,Supermarkets,5422
4,5,6CDCcdE3D0b7b44,"Diaz, Robles and Haley",https://www.brooks-scott.net/,Botswana,Inverse intangible methodology,2013,Nanotechnology,3135

In [84]:
df.tail(3)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
9997,9998,B4B92A44e0331Bc,Franklin-Ayala,http://www.torres.org/,Yemen,Polarized exuding orchestration,1983,Financial Services,8951
9998,9999,01D2539e270CEbd,Wolfe-Mckee,http://www.parks.com/,Togo,Balanced value-added ability,1975,Environmental Services,2505
9999,10000,0D3b7DcFA21d92d,Beck LLC,https://wagner-glover.com/,Georgia,Decentralized context-sensitive service-desk,2007,Wireless,4552

In [85]:
df.sample(4)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
6949,6950,160Ea02F5cf17CD,Wolfe-Mcdonald,http://www.austin.com/,Falkland Islands (Malvinas),Extended explicit hierarchy,1975,Electrical / Electronic Manufacturing,4453
811,812,e9CEdeeDD3302FE,"Ferrell, Wallace and Savage",http://www.mcdonald.org/,Poland,Business-focused systemic approach,2008,Civic / Social Organization,4697
342,343,5Aa97EaccdECB5c,Eaton-Howe,https://www.waller.com/,Kenya,Virtual intermediate challenge,1981,Computer Hardware,4574
4973,4974,a7Da07dbea33fcC,"Padilla, Nunez and Beasley",http://www.spears.com/,Haiti,User-centric web-enabled database,1981,Wholesale,9909

In [86]:
df.describe()

             Index       Founded  Number of employees
count  10000.00000  10000.000000         10000.000000
mean    5000.50000   1995.776700          4961.321000
std     2886.89568     14.991608          2911.862096
min        1.00000   1970.000000             1.000000
25%     2500.75000   1983.000000          2446.750000
50%     5000.50000   1996.000000          4894.000000
75%     7500.25000   2009.000000          7530.000000
max    10000.00000   2022.000000          9999.000000

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Index                10000 non-null  int64
 1   Organization Id      10000 non-null  object
 2   Name                 10000 non-null  object
 3   Website              10000 non-null  object
 4   Country              10000 non-null  object
 5   Description          10000 non-null  object
 6   Founded              10000 non-null  int64
 7   Industry             10000 non-null  object
 8   Number of employees  10000 non-null  int64
dtypes: int64(3), object(6)
memory usage: 703.3+ KB

In [88]:
df.columns

Index(['Index', 'Organization Id', 'Name', 'Website', 'Country', 'Description',
       'Founded', 'Industry', 'Number of employees'],
      dtype='object')

In [89]:
type(df[['Name']])

pandas.core.frame.DataFrame

In [90]:
df[['Name']]

                             Name
0                    Mckinney PLC
1                  Cunningham LLC
2                      Ruiz-Walls
3     Parrish, Osborne and Clarke
4          Diaz, Robles and Haley
...                           ...
9995           Neal, Day and Wang
9996    Barrett, Rojas and Adkins
9997               Franklin-Ayala
9998                  Wolfe-Mckee
9999                     Beck LLC

[10000 rows x 1 columns]

In [91]:
df.Name

0                      Mckinney PLC
1                    Cunningham LLC
2                        Ruiz-Walls
3       Parrish, Osborne and Clarke
4            Diaz, Robles and Haley
                   ...
9995             Neal, Day and Wang
9996      Barrett, Rojas and Adkins
9997                 Franklin-Ayala
9998                    Wolfe-Mckee
9999                       Beck LLC
Name: Name, Length: 10000, dtype: object

In [92]:
df['Number of employees'].mean()

4961.321

In [93]:
df['Number of employees'].median()

4894.0

In [94]:
df['Country'].mode()

0    Congo
Name: Country, dtype: object

In [95]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Length: 10000, dtype: bool

In [96]:
df.duplicated().sum()

0

In [97]:

df=df.drop_duplicates()

In [98]:
new_df = df.drop_duplicates(['Country', 'Founded','Industry'])
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9980 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Index                9980 non-null   int64
 1   Organization Id      9980 non-null   object
 2   Name                 9980 non-null   object
 3   Website              9980 non-null   object
 4   Country              9980 non-null   object
 5   Description          9980 non-null   object
 6   Founded              9980 non-null   int64
 7   Industry             9980 non-null   object
 8   Number of employees  9980 non-null   int64
dtypes: int64(3), object(6)
memory usage: 779.7+ KB

In [99]:
new_df = new_df.reset_index(drop=True)
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9980 entries, 0 to 9979
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Index                9980 non-null   int64
 1   Organization Id      9980 non-null   object
 2   Name                 9980 non-null   object
 3   Website              9980 non-null   object
 4   Country              9980 non-null   object
 5   Description          9980 non-null   object
 6   Founded              9980 non-null   int64
 7   Industry             9980 non-null   object
 8   Number of employees  9980 non-null   int64
dtypes: int64(3), object(6)
memory usage: 701.8+ KB

In [100]:
df.drop('Index',axis=1, inplace=True)
df.head(2)

,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,522816eF8fdBE6d,Mckinney PLC,http://soto.com/,Sri Lanka,Synergized global system engine,1988,Dairy,3930
1,70C7FBD7e6Aa3Ea,Cunningham LLC,http://harding-duffy.com/,Namibia,Team-oriented fault-tolerant adapter,2018,Library,7871

In [101]:
df.drop(['Organization Id', 'Website','Description'],axis=1, inplace=True)
df.head(2)

             Name    Country  Founded Industry  Number of employees
0    Mckinney PLC  Sri Lanka     1988    Dairy                 3930
1  Cunningham LLC    Namibia     2018  Library                 7871

In [102]:
df.drop(['Name'], axis=1, inplace=True)
df.head(2)

     Country  Founded Industry  Number of employees
0  Sri Lanka     1988    Dairy                 3930
1    Namibia     2018  Library                 7871

In [103]:
df.rename({'Number of employees':'N_emp'}, inplace=True)
df.head(2)

     Country  Founded Industry  Number of employees
0  Sri Lanka     1988    Dairy                 3930
1    Namibia     2018  Library                 7871

In [104]:
pd.get_dummies(df['Country'],drop_first=True).head()

,Albania,Algeria,American Samoa,Andorra,Angola,Anguilla,Antarctica (the territory South of 60 deg S),Antigua and Barbuda,Argentina,Armenia,...,Uruguay,Uzbekistan,Vanuatu,Venezuela,Vietnam,Wallis and Futuna,Western Sahara,Yemen,Zambia,Zimbabwe
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False